In [1]:
from getpass import getpass
import os
import pandas as pd
from sqlalchemy import create_engine, text

In [2]:
# configurar style compatível (usando um dos nomes que seu prettytable expôs)
style_choice = '_DEPRECATED_PLAIN_COLUMNS'

# aplicar configuração antes de carregar
get_ipython().run_line_magic('config', f"SqlMagic.style = '{style_choice}'")
# garantir que a extensão seja carregada depois da configuração
get_ipython().run_line_magic('load_ext', 'sql')

# queremos saída tabular do %%sql (padrão)
get_ipython().run_line_magic('config', 'SqlMagic.autopandas = False')

DB_USER = "root"
DB_HOST = "127.0.0.1"
DB_PORT = 3306
DB_NAME = "ecommerce_db"
DB_PASS = getpass("DB password: ")

conn_string = f"mysql+pymysql://{DB_USER}:{DB_PASS}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
get_ipython().run_line_magic('sql', conn_string)

DB password:  ········

## EDA - Exploratory Data Analysis

In [3]:
%%sql
USE ecommerce_db;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
0 rows affected.

[]

Total por tabela

In [4]:
%%sql
SELECT 
(SELECT COUNT(*) FROM customers) AS n_customers,
(SELECT COUNT(*) FROM products)  AS n_products,
(SELECT COUNT(*) FROM transactions) AS n_transactions,
(SELECT COUNT(*) FROM product_views) AS n_views;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
1 rows affected.

[(1000, 300, 8000, 20000)]

Top 10 produtos mais vendidos (quantidade)

In [5]:
%%sql
SELECT p.product_id, p.name, p.category, SUM(t.quantity) AS total_qty
FROM transactions t
JOIN products p ON t.product_id = p.product_id
GROUP BY p.product_id
ORDER BY total_qty DESC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
10 rows affected.

[(160, 'Eletrônicos Sony Eos', 'Eletrônicos', Decimal('75')),
 (159, 'Eletrônicos LG Officiis', 'Eletrônicos', Decimal('73')),
 (35, 'Eletrônicos LG Pariatur', 'Eletrônicos', Decimal('73')),
 (178, 'Eletrônicos Samsung Mollitia', 'Eletrônicos', Decimal('73')),
 (207, 'Eletrônicos Samsung Quia', 'Eletrônicos', Decimal('73')),
 (274, 'Eletrônicos LG Laborum', 'Eletrônicos', Decimal('71')),
 (205, 'Eletrônicos Apple Qui', 'Eletrônicos', Decimal('71')),
 (146, 'Eletrônicos Samsung Minima', 'Eletrônicos', Decimal('70')),
 (269, 'Eletrônicos LG Officiis', 'Eletrônicos', Decimal('70')),
 (78, 'Eletrônicos LG Asperiores', 'Eletrônicos', Decimal('70'))]

Top 10 produtos por receita (total_value)

In [6]:
%%sql
SELECT p.product_id, p.name, p.category, SUM(t.total_value) AS revenue
FROM transactions t
JOIN products p ON t.product_id = p.product_id
GROUP BY p.product_id
ORDER BY revenue DESC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
10 rows affected.

[(35, 'Eletrônicos LG Pariatur', 'Eletrônicos', Decimal('106396.77')),
 (159, 'Eletrônicos LG Officiis', 'Eletrônicos', Decimal('104138.88')),
 (48, 'Eletrônicos Apple Repudiandae', 'Eletrônicos', Decimal('99799.52')),
 (294, 'Eletrônicos LG Ratione', 'Eletrônicos', Decimal('96831.15')),
 (287, 'Roupas Reserva Itaque', 'Roupas', Decimal('93863.88')),
 (160, 'Eletrônicos Sony Eos', 'Eletrônicos', Decimal('93820.50')),
 (13, 'Eletrônicos Apple Libero', 'Eletrônicos', Decimal('93470.72')),
 (178, 'Eletrônicos Samsung Mollitia', 'Eletrônicos', Decimal('92384.42')),
 (198, 'Eletrônicos Sony Unde', 'Eletrônicos', Decimal('91907.40')),
 (77, 'Eletrônicos LG Assumenda', 'Eletrônicos', Decimal('90478.70'))]

### Cliente / Comportamento

Top 20 clientes por gasto total

In [7]:
%%sql
SELECT t.customer_id, COUNT(*) AS n_items, SUM(t.total_value) AS total_spent
FROM transactions t
GROUP BY t.customer_id
ORDER BY total_spent DESC
LIMIT 20;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
20 rows affected.

[(898, 14, Decimal('21652.16')),
 (830, 18, Decimal('20515.86')),
 (688, 13, Decimal('19742.79')),
 (864, 11, Decimal('19723.70')),
 (312, 14, Decimal('19460.38')),
 (435, 13, Decimal('19311.53')),
 (715, 9, Decimal('19210.86')),
 (966, 17, Decimal('18902.96')),
 (996, 11, Decimal('18839.47')),
 (269, 10, Decimal('18664.85')),
 (395, 12, Decimal('18503.12')),
 (821, 13, Decimal('18391.29')),
 (792, 13, Decimal('18349.30')),
 (289, 13, Decimal('18204.80')),
 (586, 13, Decimal('18135.30')),
 (359, 14, Decimal('18106.58')),
 (923, 13, Decimal('18101.34')),
 (443, 12, Decimal('17985.24')),
 (156, 15, Decimal('17822.43')),
 (806, 12, Decimal('17793.86'))]

Distribuição de número de compras por cliente (histograma simplificado)

In [8]:
%%sql
SELECT purchases, COUNT(*) AS n_customers
FROM (
  SELECT customer_id, COUNT(*) AS purchases
  FROM transactions
  GROUP BY customer_id
) x
GROUP BY purchases
ORDER BY purchases;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
18 rows affected.

[(1, 2),
 (2, 8),
 (3, 25),
 (4, 43),
 (5, 92),
 (6, 122),
 (7, 149),
 (8, 160),
 (9, 148),
 (10, 95),
 (11, 59),
 (12, 36),
 (13, 31),
 (14, 13),
 (15, 9),
 (16, 1),
 (17, 5),
 (18, 2)]

Taxa de conversão por produto (views -> purchases)

In [9]:
%%sql
SELECT p.product_id, p.name,
  COALESCE(v.views,0) AS views,
  COALESCE(b.buys,0)  AS buys,
  ROUND(COALESCE(b.buys,0) / NULLIF(COALESCE(v.views,0),0) * 100,2) AS conversion_pct
FROM products p
LEFT JOIN (
  SELECT product_id, COUNT(*) AS views
  FROM product_views
  GROUP BY product_id
) v ON p.product_id = v.product_id
LEFT JOIN (
  SELECT product_id, COUNT(*) AS buys
  FROM transactions
  GROUP BY product_id
) b ON p.product_id = b.product_id
ORDER BY conversion_pct DESC
LIMIT 50;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
50 rows affected.

[(81, 'Roupas Nike Sunt', 42, 45, Decimal('107.14')),
 (159, 'Eletrônicos LG Officiis', 56, 53, Decimal('94.64')),
 (207, 'Eletrônicos Samsung Quia', 61, 56, Decimal('91.80')),
 (160, 'Eletrônicos Sony Eos', 59, 54, Decimal('91.53')),
 (16, 'Roupas Nike Totam', 55, 49, Decimal('89.09')),
 (129, 'Roupas Puma Consectetur', 55, 47, Decimal('85.45')),
 (275, 'Eletrônicos Apple Harum', 60, 51, Decimal('85.00')),
 (256, 'Eletrônicos Apple Laboriosam', 52, 44, Decimal('84.62')),
 (284, 'Casa Tramontina Incidunt', 55, 46, Decimal('83.64')),
 (178, 'Eletrônicos Samsung Mollitia', 69, 56, Decimal('81.16')),
 (35, 'Eletrônicos LG Pariatur', 60, 48, Decimal('80.00')),
 (233, 'Roupas Adidas Omnis', 63, 50, Decimal('79.37')),
 (274, 'Eletrônicos LG Laborum', 65, 51, Decimal('78.46')),
 (139, 'Roupas Puma Eius', 61, 47, Decimal('77.05')),
 (145, 'Eletrônicos LG Fugiat', 60, 46, Decimal('76.67')),
 (65, 'Roupas Reserva Asperiores', 62, 47, Decimal('75.81')),
 (216, 'Casa Electrolux Facere', 57, 43, Decimal('75.44')),
 (51, 'Casa Brastemp Suscipit', 61, 46, Decimal('75.41')),
 (78, 'Eletrônicos LG Asperiores', 61, 46, Decimal('75.41')),
 (164, 'Casa Brastemp Adipisci', 59, 44, Decimal('74.58')),
 (60, 'Roupas Puma Possimus', 54, 40, Decimal('74.07')),
 (121, 'Roupas Reserva Occaecati', 65, 48, Decimal('73.85')),
 (11, 'Roupas Puma Veritatis', 66, 48, Decimal('72.73')),
 (277, 'Eletrônicos Apple Ad', 51, 37, Decimal('72.55')),
 (93, 'Roupas Nike Saepe', 61, 44, Decimal('72.13')),
 (123, 'Eletrônicos LG Maiores', 61, 44, Decimal('72.13')),
 (290, 'Eletrônicos Sony Commodi', 53, 38, Decimal('71.70')),
 (269, 'Eletrônicos LG Officiis', 63, 45, Decimal('71.43')),
 (106, 'Eletrônicos LG Ipsa', 59, 42, Decimal('71.19')),
 (72, 'Casa Tramontina Dolorum', 52, 37, Decimal('71.15')),
 (254, 'Eletrônicos LG Ipsum', 58, 41, Decimal('70.69')),
 (203, 'Eletrônicos LG Assumenda', 61, 43, Decimal('70.49')),
 (197, 'Casa Electrolux Repellendus', 60, 42, Decimal('70.00')),
 (135, 'Eletrônicos Apple Excepturi', 59, 41, Decimal('69.49')),
 (77, 'Eletrônicos LG Assumenda', 62, 43, Decimal('69.35')),
 (56, 'Roupas Puma Molestiae', 65, 45, Decimal('69.23')),
 (76, 'Roupas Adidas Eos', 55, 38, Decimal('69.09')),
 (18, 'Roupas Reserva Illum', 58, 40, Decimal('68.97')),
 (21, 'Roupas Adidas Corrupti', 61, 42, Decimal('68.85')),
 (146, 'Eletrônicos Samsung Minima', 70, 48, Decimal('68.57')),
 (66, 'Eletrônicos Sony Numquam', 66, 45, Decimal('68.18')),
 (126, 'Roupas Puma Magnam', 59, 40, Decimal('67.80')),
 (27, 'Eletrônicos Sony Quae', 62, 42, Decimal('67.74')),
 (273, 'Roupas Adidas Voluptate', 61, 41, Decimal('67.21')),
 (271, 'Eletrônicos Apple Dolorem', 61, 41, Decimal('67.21')),
 (48, 'Eletrônicos Apple Repudiandae', 64, 43, Decimal('67.19')),
 (175, 'Eletrônicos Samsung Veritatis', 73, 49, Decimal('67.12')),
 (153, 'Casa Tramontina Delectus', 54, 36, Decimal('66.67')),
 (181, 'Roupas Reserva Non', 66, 44, Decimal('66.67')),
 (172, 'Casa Electrolux Pariatur', 60, 40, Decimal('66.67'))]

### Séries temporais & tendências

Vendas por mês (quantidade e receita)

In [10]:
%%sql
SELECT DATE_FORMAT(transaction_date, '%Y-%m') AS ym,
       COUNT(*) AS n_items,
       SUM(total_value) AS revenue
FROM transactions
GROUP BY ym
ORDER BY ym;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
13 rows affected.

[('2024-12', 439, Decimal('489036.22')),
 ('2025-01', 673, Decimal('739380.78')),
 ('2025-02', 639, Decimal('744580.75')),
 ('2025-03', 652, Decimal('736626.89')),
 ('2025-04', 624, Decimal('679666.74')),
 ('2025-05', 704, Decimal('767906.93')),
 ('2025-06', 651, Decimal('723028.14')),
 ('2025-07', 714, Decimal('802499.22')),
 ('2025-08', 677, Decimal('771369.82')),
 ('2025-09', 622, Decimal('676160.23')),
 ('2025-10', 662, Decimal('712924.22')),
 ('2025-11', 682, Decimal('757181.55')),
 ('2025-12', 261, Decimal('278362.68'))]

Média diária de visitas e compras (últimos 30 dias)

In [11]:
%%sql
WITH views AS (
  SELECT DATE(view_datetime) AS date,
         COUNT(DISTINCT CONCAT(customer_id, '-', product_id, DATE(view_datetime))) AS views
  FROM product_views
  WHERE view_datetime >= CURDATE() - INTERVAL 30 DAY
  GROUP BY DATE(view_datetime)
),
buys AS (
  SELECT DATE(transaction_date) AS date,
         COUNT(*) AS buys
  FROM transactions
  WHERE transaction_date >= CURDATE() - INTERVAL 30 DAY
  GROUP BY DATE(transaction_date)
)
SELECT v.date,
       v.views,
       COALESCE(b.buys, 0) AS buys
FROM views v
LEFT JOIN buys b ON v.date = b.date
ORDER BY v.date
LIMIT 20;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
20 rows affected.

[(datetime.date(2025, 11, 11), 40, 26),
 (datetime.date(2025, 11, 12), 55, 27),
 (datetime.date(2025, 11, 13), 63, 26),
 (datetime.date(2025, 11, 14), 53, 35),
 (datetime.date(2025, 11, 15), 56, 21),
 (datetime.date(2025, 11, 16), 49, 26),
 (datetime.date(2025, 11, 17), 57, 18),
 (datetime.date(2025, 11, 18), 54, 15),
 (datetime.date(2025, 11, 19), 58, 17),
 (datetime.date(2025, 11, 20), 41, 30),
 (datetime.date(2025, 11, 21), 53, 17),
 (datetime.date(2025, 11, 22), 55, 24),
 (datetime.date(2025, 11, 23), 56, 25),
 (datetime.date(2025, 11, 24), 53, 17),
 (datetime.date(2025, 11, 25), 50, 23),
 (datetime.date(2025, 11, 26), 55, 21),
 (datetime.date(2025, 11, 27), 66, 34),
 (datetime.date(2025, 11, 28), 66, 26),
 (datetime.date(2025, 11, 29), 60, 26),
 (datetime.date(2025, 11, 30), 52, 24)]

### Cohorts / Recência / RFMs

Última data de compra por cliente (recency)

In [12]:
%%sql
SELECT customer_id, MAX(transaction_date) AS last_purchase
FROM transactions
GROUP BY customer_id
LIMIT 20;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
20 rows affected.

[(1, datetime.datetime(2025, 9, 26, 5, 23, 4)),
 (2, datetime.datetime(2025, 11, 17, 18, 4, 55)),
 (3, datetime.datetime(2025, 12, 5, 3, 56, 42)),
 (4, datetime.datetime(2025, 11, 30, 15, 54, 39)),
 (5, datetime.datetime(2025, 11, 18, 1, 4, 50)),
 (6, datetime.datetime(2025, 12, 4, 16, 34, 33)),
 (7, datetime.datetime(2025, 10, 13, 10, 39, 39)),
 (8, datetime.datetime(2025, 12, 9, 7, 47, 9)),
 (9, datetime.datetime(2025, 11, 10, 22, 44, 58)),
 (10, datetime.datetime(2025, 9, 20, 15, 40, 52)),
 (11, datetime.datetime(2025, 12, 9, 14, 0, 42)),
 (12, datetime.datetime(2025, 11, 25, 14, 27, 2)),
 (13, datetime.datetime(2025, 12, 1, 11, 52, 51)),
 (14, datetime.datetime(2025, 12, 3, 15, 15, 48)),
 (15, datetime.datetime(2025, 11, 26, 23, 45, 47)),
 (16, datetime.datetime(2025, 11, 30, 16, 33, 54)),
 (17, datetime.datetime(2025, 11, 30, 0, 7, 54)),
 (18, datetime.datetime(2025, 11, 28, 6, 28, 31)),
 (19, datetime.datetime(2025, 12, 9, 0, 0, 35)),
 (20, datetime.datetime(2025, 7, 15, 21, 10, 18))]

RFM buckets básicos (recency, frequency, monetary)

In [13]:
%%sql
WITH last AS (
  SELECT customer_id,
         DATEDIFF(CURDATE(), MAX(DATE(transaction_date))) AS recency_days,
         COUNT(*) AS frequency,
         SUM(total_value) AS monetary
  FROM transactions
  GROUP BY customer_id
)
SELECT
  customer_id,
  recency_days,
  frequency,
  monetary,
  CASE WHEN recency_days <= 30 THEN 'R1' WHEN recency_days <= 90 THEN 'R2' ELSE 'R3' END AS recency_group,
  CASE WHEN frequency >= 20 THEN 'F1' WHEN frequency >= 5 THEN 'F2' ELSE 'F3' END AS freq_group,
  CASE WHEN monetary >= 1000 THEN 'M1' WHEN monetary >= 200 THEN 'M2' ELSE 'M3' END AS money_group
FROM last
ORDER BY monetary DESC
LIMIT 20;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
20 rows affected.

[(898, -1, 14, Decimal('21652.16'), 'R1', 'F2', 'M1'),
 (830, 9, 18, Decimal('20515.86'), 'R1', 'F2', 'M1'),
 (688, 48, 13, Decimal('19742.79'), 'R2', 'F2', 'M1'),
 (864, 44, 11, Decimal('19723.70'), 'R2', 'F2', 'M1'),
 (312, 15, 14, Decimal('19460.38'), 'R1', 'F2', 'M1'),
 (435, 6, 13, Decimal('19311.53'), 'R1', 'F2', 'M1'),
 (715, 9, 9, Decimal('19210.86'), 'R1', 'F2', 'M1'),
 (966, 2, 17, Decimal('18902.96'), 'R1', 'F2', 'M1'),
 (996, 27, 11, Decimal('18839.47'), 'R1', 'F2', 'M1'),
 (269, 16, 10, Decimal('18664.85'), 'R1', 'F2', 'M1'),
 (395, 66, 12, Decimal('18503.12'), 'R2', 'F2', 'M1'),
 (821, 26, 13, Decimal('18391.29'), 'R1', 'F2', 'M1'),
 (792, 16, 13, Decimal('18349.30'), 'R1', 'F2', 'M1'),
 (289, 11, 13, Decimal('18204.80'), 'R1', 'F2', 'M1'),
 (586, 25, 13, Decimal('18135.30'), 'R1', 'F2', 'M1'),
 (359, 11, 14, Decimal('18106.58'), 'R1', 'F2', 'M1'),
 (923, 37, 13, Decimal('18101.34'), 'R2', 'F2', 'M1'),
 (443, 1, 12, Decimal('17985.24'), 'R1', 'F2', 'M1'),
 (156, 32, 15, Decimal('17822.43'), 'R2', 'F2', 'M1'),
 (806, 1, 12, Decimal('17793.86'), 'R1', 'F2', 'M1')]

### Produtos comprados juntos (co-ocorrência / aproximação rules)

Itens comprados juntos (pares por dia)

In [14]:
%%sql
SELECT a.product_id AS product_a, b.product_id AS product_b, COUNT(*) AS pair_count
FROM (
  SELECT customer_id, DATE(transaction_date) AS tx_date, product_id
  FROM transactions
) a
JOIN (
  SELECT customer_id, DATE(transaction_date) AS tx_date, product_id
  FROM transactions
) b
  ON a.customer_id = b.customer_id AND a.tx_date = b.tx_date AND a.product_id < b.product_id
GROUP BY a.product_id, b.product_id
ORDER BY pair_count DESC
LIMIT 50;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
50 rows affected.

[(183, 269, 1),
 (26, 220, 1),
 (183, 231, 1),
 (203, 248, 1),
 (118, 241, 1),
 (26, 223, 1),
 (76, 209, 1),
 (48, 247, 1),
 (135, 295, 1),
 (122, 186, 1),
 (128, 227, 1),
 (217, 292, 1),
 (14, 269, 1),
 (4, 292, 1),
 (156, 190, 1),
 (48, 261, 1),
 (60, 200, 1),
 (78, 135, 1),
 (50, 265, 1),
 (75, 128, 1),
 (12, 175, 1),
 (6, 287, 1),
 (142, 217, 1),
 (88, 118, 1),
 (88, 241, 1),
 (210, 264, 1),
 (100, 246, 1),
 (149, 155, 1),
 (163, 288, 1),
 (65, 295, 1),
 (200, 210, 1),
 (75, 121, 1),
 (161, 235, 1),
 (18, 153, 1),
 (240, 270, 1),
 (186, 290, 1),
 (31, 231, 1),
 (6, 27, 1),
 (164, 195, 1),
 (239, 269, 1),
 (99, 222, 1),
 (101, 203, 1),
 (186, 233, 1),
 (219, 221, 1),
 (102, 261, 1),
 (8, 39, 1),
 (35, 269, 1),
 (180, 198, 1),
 (140, 247, 1),
 (67, 159, 1)]

Suporte, confiança e lift (estimativas)

In [15]:
%%sql
WITH pairs AS (
  SELECT a.product_id AS a, b.product_id AS b, COUNT(*) AS cnt_ab
  FROM (
    SELECT customer_id, DATE(transaction_date) AS tx_date, product_id
    FROM transactions
  ) a
  JOIN (
    SELECT customer_id, DATE(transaction_date) AS tx_date, product_id
    FROM transactions
  ) b
    ON a.customer_id = b.customer_id AND a.tx_date = b.tx_date AND a.product_id < b.product_id
  GROUP BY a.product_id, b.product_id
),
support AS (
  SELECT product_id, COUNT(*) AS cnt
  FROM (
    SELECT customer_id, DATE(transaction_date) AS tx_date, product_id
    FROM transactions
  ) t
  GROUP BY product_id
),
total_tx AS (SELECT COUNT(DISTINCT CONCAT(customer_id, DATE(transaction_date))) AS total_orders FROM transactions)
SELECT p.a, p.b, p.cnt_ab,
       s_a.cnt AS support_a,
       s_b.cnt AS support_b,
       ROUND(p.cnt_ab / s_a.cnt, 4) AS confidence_a_to_b,
       ROUND(p.cnt_ab * (SELECT total_orders FROM total_tx) / (s_a.cnt * s_b.cnt), 4) AS lift_estimate
FROM pairs p
JOIN support s_a ON p.a = s_a.product_id
JOIN support s_b ON p.b = s_b.product_id
ORDER BY p.cnt_ab DESC
LIMIT 30;

 * mysql+pymysql://root:***@127.0.0.1:3306/ecommerce_db
30 rows affected.

[(183, 269, 1, 37, 45, Decimal('0.0270'), Decimal('4.7616')),
 (26, 220, 1, 15, 15, Decimal('0.0667'), Decimal('35.2356')),
 (183, 231, 1, 37, 41, Decimal('0.0270'), Decimal('5.2261')),
 (203, 248, 1, 43, 5, Decimal('0.0233'), Decimal('36.8744')),
 (118, 241, 1, 21, 31, Decimal('0.0476'), Decimal('12.1782')),
 (26, 223, 1, 15, 14, Decimal('0.0667'), Decimal('37.7524')),
 (76, 209, 1, 38, 28, Decimal('0.0263'), Decimal('7.4511')),
 (48, 247, 1, 43, 41, Decimal('0.0233'), Decimal('4.4969')),
 (135, 295, 1, 41, 36, Decimal('0.0244'), Decimal('5.3713')),
 (122, 186, 1, 39, 36, Decimal('0.0256'), Decimal('5.6467')),
 (128, 227, 1, 33, 37, Decimal('0.0303'), Decimal('6.4930')),
 (217, 292, 1, 37, 40, Decimal('0.0270'), Decimal('5.3568')),
 (14, 269, 1, 41, 45, Decimal('0.0244'), Decimal('4.2970')),
 (4, 292, 1, 32, 40, Decimal('0.0313'), Decimal('6.1938')),
 (156, 190, 1, 33, 8, Decimal('0.0303'), Decimal('30.0303')),
 (48, 261, 1, 43, 28, Decimal('0.0233'), Decimal('6.5847')),
 (60, 200, 1, 40, 18, Decimal('0.0250'), Decimal('11.0111')),
 (78, 135, 1, 46, 41, Decimal('0.0217'), Decimal('4.2036')),
 (50, 265, 1, 39, 3, Decimal('0.0256'), Decimal('67.7607')),
 (75, 128, 1, 35, 33, Decimal('0.0286'), Decimal('6.8641')),
 (12, 175, 1, 33, 49, Decimal('0.0303'), Decimal('4.9029')),
 (6, 287, 1, 32, 40, Decimal('0.0313'), Decimal('6.1938')),
 (142, 217, 1, 45, 37, Decimal('0.0222'), Decimal('4.7616')),
 (88, 118, 1, 44, 21, Decimal('0.0227'), Decimal('8.5801')),
 (88, 241, 1, 44, 31, Decimal('0.0227'), Decimal('5.8123')),
 (210, 264, 1, 18, 42, Decimal('0.0556'), Decimal('10.4868')),
 (100, 246, 1, 38, 42, Decimal('0.0263'), Decimal('4.9674')),
 (149, 155, 1, 23, 12, Decimal('0.0435'), Decimal('28.7246')),
 (163, 288, 1, 21, 13, Decimal('0.0476'), Decimal('29.0403')),
 (65, 295, 1, 47, 36, Decimal('0.0213'), Decimal('4.6856'))]